[
  {
    "pageSuid": "f3UoO6jWFz",
    "pageSlug": "the-history-of-mapping",
    "lang": "en",
    "content": "<h2 class=\"int-link-anchors\">The History of Mapping</h2>\n<h3 data-start=\"356\" data-end=\"411\">From Caves to Cubes: A History of Mapping Light</h3>\n<p data-start=\"413\" data-end=\"1055\">Before the term <em data-start=\"429\" data-end=\"444\">video mapping</em> existed, humans were already mapping the world through light and surface.</p>\n<p data-start=\"413\" data-end=\"1055\">In the depths of the&nbsp;<strong data-start=\"540\" data-end=\"561\">Grotte de Lascaux,</strong>&nbsp;<strong data-start=\"565\" data-end=\"576\">Chauvet </strong>and<strong data-start=\"565\" data-end=\"576\"> Pech Merle </strong>in France, the first image-makers discovered that the irregular shapes of the cave walls could become part of the image itself.</p>\n<p data-start=\"413\" data-end=\"1055\">The convexities of rock became the flanks of a bison, the shadow of a torch made an animal appear to move.</p>\n<p data-start=\"413\" data-end=\"1055\">These early artists were not just painting; they were&nbsp;<em data-start=\"856\" data-end=\"865\">mapping</em> &mdash; using the architecture of the world as a canvas, embedding illusion within matter.</p>\n<p data-start=\"413\" data-end=\"1055\">The rock surface was not neutral background but a collaborator, a primitive topology for representation.</p>\n<p data-start=\"413\" data-end=\"1055\">&nbsp;</p>\n<figure class=\"image\" contenteditable=\"false\"><img src=\"https://download.madmapper.com/madshop_prod/pechmerle.jpg\" width=\"800\" height=\"518\" data-media-id=\"iY6kOvAyzx\">\n<figcaption contenteditable=\"true\">Pech Merle cave</figcaption>\n</figure>\n<p data-start=\"413\" data-end=\"1055\">&nbsp;</p>\n<p data-start=\"1057\" data-end=\"1725\">Centuries later, this same dialogue between image and space found new expression in the <strong data-start=\"1145\" data-end=\"1160\">Renaissance</strong>.</p>\n<p data-start=\"1057\" data-end=\"1725\">The discovery of linear perspective by Brunelleschi and Alberti was, in essence, a mathematical form of mapping &mdash; a way to project three-dimensional reality onto a two-dimensional plane.</p>\n<p data-start=\"1057\" data-end=\"1725\">Artists like&nbsp;<strong data-start=\"1362\" data-end=\"1387\">Pere Borrell del Caso</strong>, with his 1874 painting <em data-start=\"1412\" data-end=\"1432\">Escaping Criticism</em>, pushed the illusion to its paradoxical limit: the figure literally steps out of the frame. The painted world invades the viewer&rsquo;s world.</p>\n<p data-start=\"1057\" data-end=\"1725\">The image reclaims space. This is the spirit of&nbsp;<em data-start=\"1619\" data-end=\"1633\">trompe-l&rsquo;&oelig;il</em> &mdash; a trick of the eye that anticipates every future experiment where image and reality blur.</p>\n<p data-start=\"1057\" data-end=\"1725\">&nbsp;</p>\n<figure class=\"image\" contenteditable=\"false\"><img src=\"https://download.madmapper.com/madshop_prod/pere_borell.jpg\" width=\"800\" height=\"295\" data-media-id=\"7plq8lDcXq\">\n<figcaption contenteditable=\"true\">Pere Borell Del Caso</figcaption>\n</figure>\n<p data-start=\"1057\" data-end=\"1725\">&nbsp;</p>\n<p data-start=\"1727\" data-end=\"2135\">By the <strong data-start=\"1734\" data-end=\"1745\">Baroque</strong> era, illusion expanded beyond the canvas to encompass whole architectures. The frescoes of <strong data-start=\"1837\" data-end=\"1853\">Andrea Pozzo</strong> at Sant&rsquo;Ignazio in Rome transformed ceilings into infinite heavens, merging painting, perspective, and built space.</p>\n<p data-start=\"1727\" data-end=\"2135\">Churches became immersive environments &mdash; proto-domes of projection &mdash; where light and geometry conspired to suspend disbelief.</p>\n<p data-start=\"1727\" data-end=\"2135\">The human eye was now inside the image.</p>\n<p data-start=\"1727\" data-end=\"2135\">&nbsp;</p>\n<figure class=\"image\" contenteditable=\"false\"><img src=\"https://download.madmapper.com/madshop_prod/saintignazio.jpg\" width=\"800\" height=\"465\" data-media-id=\"YN0Yf1aFI2\">\n<figcaption contenteditable=\"true\">The Apotheosis of St Ignatius, Andrea-Pozzo 1685</figcaption>\n</figure>\n<p data-start=\"1727\" data-end=\"2135\">&nbsp;</p>\n<p data-start=\"2137\" data-end=\"2672\">With the twentieth century came the dematerialization of image and matter.</p>\n<p data-start=\"2137\" data-end=\"2672\">The paintbrush gave way to the&nbsp;<strong data-start=\"2243\" data-end=\"2256\">projector</strong>. French architect and artist <strong data-start=\"2286\" data-end=\"2308\">Hans Walter M&uuml;ller</strong>, beginning in the 1960s, developed inflatable architectures and projected diapositives onto their translucent membranes, sometimes inside natural caves, calling theses \"topoprojections\".</p>\n<p data-start=\"2137\" data-end=\"2672\">His environments breathed, expanded, and glowed &mdash; living architectures of light. M&uuml;ller&rsquo;s work fused the ephemeral and the structural, prefiguring the &ldquo;mapped&rdquo; light architectures that would come decades later.</p>\n<p data-start=\"2137\" data-end=\"2672\">&nbsp;</p>\n<figure class=\"image\" contenteditable=\"false\"><img src=\"https://download.madmapper.com/madshop_prod/hanswaltermuller.jpg\" width=\"800\" height=\"498\" data-media-id=\"ac1myJp0pc\">\n<figcaption contenteditable=\"true\">Hans Walter Muller, \"Topoprojection\", France, 1979</figcaption>\n</figure>\n<p data-start=\"2137\" data-end=\"2672\">&nbsp;</p>\n<p data-start=\"2674\" data-end=\"3282\">In the <strong data-start=\"2681\" data-end=\"2690\">1980s</strong>, American artist <strong data-start=\"2708\" data-end=\"2727\">Michael Naimark</strong> introduced a crucial shift: the feedback loop between real space and projected image.</p>\n<p data-start=\"2674\" data-end=\"3282\">In his project&nbsp;<em data-start=\"2829\" data-end=\"2844\">Displacements</em> (1980&ndash;84), he filmed a domestic scene using a rotating camera, then projected the same footage back into the same space using a rotating projector. The result was uncanny &mdash; a ghost of the recorded world haunting its original location.</p>\n<p data-start=\"2674\" data-end=\"3282\">Time, memory, and perspective were mapped together. Here the image no longer represents space; it&nbsp;<em data-start=\"3178\" data-end=\"3188\">inhabits</em> it.</p>\n<p data-start=\"2674\" data-end=\"3282\">Naimark&rsquo;s moving projection becomes a spatial event &mdash; a living cartography of perception.</p>\n<p data-start=\"2674\" data-end=\"3282\">&nbsp;</p>\n<figure class=\"image\" contenteditable=\"false\"><img src=\"https://download.madmapper.com/madshop_prod/naimark.png\" width=\"800\" height=\"168\" data-media-id=\"fvNO9AOwEY\">\n<figcaption contenteditable=\"true\">Michael Naimark, \"Displacements\", 1984</figcaption>\n</figure>\n<p data-start=\"2674\" data-end=\"3282\">&nbsp;</p>\n<p data-start=\"3284\" data-end=\"3779\">Parallel explorations emerged in experimental cinema and performance art:&nbsp;<strong data-start=\"3496\" data-end=\"3518\">Krzysztof Wodiczko</strong> projected faces of marginalized voices onto urban monuments, politicizing architecture through illumination.</p>\n<p data-start=\"3284\" data-end=\"3779\">His works redefined the relationship between body, space, and image &mdash; each was a step toward mapping as a live, spatial, and social practice.</p>\n<p data-start=\"3284\" data-end=\"3779\">&nbsp;</p>\n<figure class=\"image\" contenteditable=\"false\"><img src=\"https://download.madmapper.com/madshop_prod/wodickzko.jpg\" width=\"800\" height=\"528\" data-media-id=\"AD2BjlYXXG\">\n<figcaption contenteditable=\"true\">Wodiczko</figcaption>\n</figure>\n<p data-start=\"3284\" data-end=\"3779\">&nbsp;</p>\n<p data-start=\"3781\" data-end=\"4532\">By the&nbsp;<strong data-start=\"3788\" data-end=\"3797\">2000s</strong>, this lineage converged in the rise of <strong data-start=\"3837\" data-end=\"3854\">video mapping</strong>, as digital technology enabled real-time alignment of image and architecture.</p>\n<p data-start=\"3781\" data-end=\"4532\">The artist-collective&nbsp;<strong data-start=\"3955\" data-end=\"3964\">EXYZT</strong>, later evolving into <strong data-start=\"3986\" data-end=\"4007\">1024 Architecture</strong>, translated this long history of illusion into the language of pixels, code, and stage performance.</p>\n<p data-start=\"3781\" data-end=\"4532\">In&nbsp;<strong data-start=\"4111\" data-end=\"4151\">&Eacute;tienne de Cr&eacute;cy&rsquo;s &ldquo;Beats and Cubes&rdquo;</strong> live shows (2007), they constructed a luminous cubic structure whose geometry was mapped with video and synchronized with electronic sound. The cube pulsed, folded, and unfolded in sync with the beat &mdash; architecture became instrument, fa&ccedil;ade became choreography.</p>\n<p data-start=\"3781\" data-end=\"4532\">The legacy of Lascaux&rsquo;s shadows returned, now algorithmically controlled, projected on modular space instead of stone.</p>\n<p data-start=\"3781\" data-end=\"4532\">&nbsp;</p>\n<figure class=\"image\" contenteditable=\"false\"><img src=\"https://download.madmapper.com/madshop_prod/decrecy_1024.png\" width=\"800\" height=\"550\" data-media-id=\"fg88LSoeJD\">\n<figcaption contenteditable=\"true\">SquareCube, 1024 architecture, 2007</figcaption>\n</figure>\n<p data-start=\"3781\" data-end=\"4532\">&nbsp;</p>\n<p data-start=\"3781\" data-end=\"4532\">From <strong data-start=\"175\" data-end=\"183\">2010</strong> onward, the story of mapping entered a new chapter with the creation of <strong data-start=\"256\" data-end=\"269\">MadMapper</strong>, a software developed <em data-start=\"292\" data-end=\"317\">by artists, for artists</em>.</p>\n<p data-start=\"3781\" data-end=\"4532\">Conceived by the Geneva-based studio&nbsp;<strong data-start=\"356\" data-end=\"370\">GarageCube</strong> (creators of Modul8) in collaboration with <strong data-start=\"414\" data-end=\"435\">1024 Architecture</strong>, MadMapper distilled the complex craft of projection alignment into an intuitive visual interface.</p>\n<p data-start=\"3781\" data-end=\"4532\">What had once required specialized engineering became a fluid act of creation &mdash; drawing with light in real space.</p>\n<p data-start=\"3781\" data-end=\"4532\">This tool opened the field to a generation of designers, musicians, VJs, and visual artists, transforming mapping from an experimental niche into a widespread artistic language.</p>\n<p data-start=\"3781\" data-end=\"4532\">Like the pigments of Lascaux or the perspective grids of the Renaissance, MadMapper became the new brush of its era &mdash; a technology that democratized illusion, empowering anyone to sculpt space with light.</p>\n<p data-start=\"3781\" data-end=\"4532\">&nbsp;</p>\n<figure class=\"image\" contenteditable=\"false\"><img src=\"https://download.madmapper.com/madshop_prod/mmv3.png\" width=\"800\" height=\"322\" data-media-id=\"lb8QAeZukd\">\n<figcaption contenteditable=\"true\">MadMapper, version 3</figcaption>\n</figure>\n<p data-start=\"3781\" data-end=\"4532\">&nbsp;</p>\n<p data-start=\"4534\" data-end=\"4879\">Today, mapping is no longer an illusion of depth on a surface &mdash; it is a method of composing reality itself.</p>\n<p data-start=\"4534\" data-end=\"4879\">From painted caves to digital architectures, each epoch redefined the link between image and world, light and structure.</p>\n<p data-start=\"4534\" data-end=\"4879\">The gesture remains the same: to reveal the hidden space between matter and vision, between seeing and being seen.</p>\n<p data-start=\"4534\" data-end=\"4879\">As the beam of a projector finds its surface, we are still in the cave, tracing the contours of the world with light.</p>"
  },
  {
    "pageSuid": "MG8sM211wn",
    "pageSlug": "what's-new",
    "lang": "en",
    "content": ""
  },
  {
    "pageSuid": "3hgIot1RBf",
    "pageSlug": "madmapper-v6-at-a-glance",
    "lang": "en",
    "content": "<h2 class=\"int-link-anchors\">Discover MadMapper v6 Highlights</h2>\n<p><em>(current infos and texts below from first MadMapper Beta 6 newsletter - November 2024)</em></p>\n<h4>Timelines</h4>\n<p>Take control of any parameter in a timely fashion! As simple as that. Bezier, Catmull Rom, Linear or not interpolated on the menu.</p>\n<h4>Montage Tracks</h4>\n<p class=\"p1\">Create as many montage tracks as you like, as with non linear editing software. Cut, chop, arrange or time-reverse your medias the easy way. Before or once you&rsquo;ve crafted your montage track, simply assign it to the surface of your choice.</p>\n<h4>Timelines grid</h4>\n<p class=\"p1\">Multiple timelines offer the flexibility to improvise by managing various sequences and switching between them to respond to the moment. Additionally, you can define a trigger exclusivity: either horizontally or vertically, even on the whole grid for mutually exclusive timelines.</p>\n<h4>MAD conductor</h4>\n<p class=\"p1\">It's the conduct of your entire show ! Its dedicated view lets you organize your entire project, providing the info your need at your fingertips. Another MAD news: you can now manage and synchronize your entire show with Midi Time Code (MTC) or Linear Time Code (LTC).</p>\n<h4>MAD clips</h4>\n<p class=\"p1\">MadMapper 6 also introduces Clips : short, repeatable, and loopable segments. These are ghostable and can be consolidated as unique elements as well. It's a great way to manipulate your content !</p>\n<h4>Audio track</h4>\n<p class=\"p1\">Audio tracks come with advanced FFT analysis, offering powerful new options for audiovisual synchronization. It provides a visually stunning and practical way to see audio frequencies, making it easier than ever to place triggers with precision. A wonder for syncing visual elements to specific frequencies or beats !</p>\n<h4>Markers</h4>\n<p class=\"p1\">Within your timeline tracks, you can set up markers with follow actions to bring basic logic and interactivity to your timelines. Wait for specific events such as button presses, custom goto to jump to specific parts of your show based on different actions and so on... Booya !</p>\n<h4>Export</h4>\n<p class=\"p1\">Another game-changer: you can now bake your entire mapping, including Laser, DMX, Video, and Audio elements, all in one go! Whether it&rsquo;s your entire project or just a loop section, simply click the Export button in the top-right corner of the timeline and you'll get access to this export window including audio, video codecs settings, and more.</p>\n<h4>DMX outputs</h4>\n<p class=\"p1\">DMX fixtures now sample directly within video surfaces ! Composite surfaces in realtime and convert your layer stack to light ! By default, this enables automatic DMX canvas generation, but for more accuracy you can also define a custom DMX canvas for pixel-perfect control. Plus you can create multiple canvas instances in the projectors tab.</p>\n<h4>Projects workspaces</h4>\n<p class=\"p1\">We&rsquo;ve significantly enhanced project structure capabilities, now embedded in a local workspace. So you create a project, save it, and instead of having a .mad project, you now get a local workspace hosting your entire project. The workspace includes everything ! From materials and media to auto-saves, making it easier than ever to keep all project elements in one clean, accessible location. Collect and save your ressources from the File menu, then simply copy this entire folder to transfer your project to another computer !</p>\n<h4>Offline library</h4>\n<p class=\"p1\">No more reliance on online materials and fx ! When you first start MadMapper, your entire library downloads directly to your computer, making it so much more convenient for offline work. The Library tab therefore hosts all your materials and fx, giving you quick access whether you're online or offline !</p>\n<h4>Optimized UI</h4>\n<p class=\"p1\">One more standout change: the media pool is now conveniently positioned on the left, right beside the surfaces in order to put everything you need within easy reach. One trick though - if you prefer the previous layout, you can switch back via the View / Separate Media Tab menu. However keeping media on the left greatly improves comfort and workflow when using the timeline !</p>\n<p class=\"p2\">&nbsp;</p>\n<p class=\"p2\"><em>(added later features)</em></p>\n<h4>MadLaser</h4>\n<p class=\"p1\">new Laser Circle surface type.</p>\n<h4>Audio routing</h4>\n<p class=\"p1\">on movies &amp; montage tracks.</p>"
  },
  {
    "pageSuid": "SYKeWyRxZh",
    "pageSlug": "release-notes",
    "lang": "en",
    "content": "<h2 class=\"int-link-anchors\">MadMapper v6 Release Notes History</h2>\n<h3>Beta Releases</h3>\n<h4>MadMapper 6.0 Beta 19 Release Notes</h4>\n<p><span style=\"text-decoration: underline;\">ADDITIONS</span><br>+ Major User Interface refresh<br>+ Surface Lines &amp; Masks list can be resized</p>\n<p>&nbsp;</p>\n<p><span style=\"text-decoration: underline;\">IMPROVEMENTS</span><br>* Timeline<br>&nbsp; &nbsp; * Show error message if trying to encode a too long WAV file (ie 2 hours / 6 channels / 44kHz)<br>&nbsp; &nbsp; * Improved multichannel audio quality in timeline exports<br>&nbsp; &nbsp; * Improved quantization<br>&nbsp; &nbsp; * Improved selection with bezier when too close (so we can move base handle when zooming out)<br>&nbsp; &nbsp; * First frame number is now zero (it was starting at one, zero most common)<br>* Keep Surface FX parameters visible when disabling FX</p>\n<p>&nbsp;</p>\n<p><span style=\"text-decoration: underline;\">FIXES</span><br>- Timeline:<br>&nbsp; &nbsp; - Fixed an issue with Insert Time / Delete Time<br>&nbsp; &nbsp; - Fixed crash when importing a 10 ms long audio file<br>&nbsp; &nbsp; - Few user interface improvements<br>&nbsp; &nbsp; - Fixed possible issue where a movie audio could not start when fading visibility from cues / timelines<br>&nbsp; &nbsp; - Fixed exporting alpha with ProRes4444 or HapAlpha<br>&nbsp; &nbsp; - Respect DMX Fixture sliders order in timeline tracks<br>- Fixed DMX Master level handling<br>- Restore outputs \"Show Test Pattern\" state when reloading a project file<br>- HAP Movies with audio could get shortened in some conditions</p>\n<h4>MadMapper 6.0 Beta 18 Release Notes</h4>\n<p><span style=\"text-decoration: underline;\">ADDITIONS</span><br>+ Timeline:<br>&nbsp; &nbsp; + Added control \"update\" to update a Scene or update startup values of a cue / timeline</p>\n<p>&nbsp;</p>\n<p><span style=\"text-decoration: underline;\">FIXES</span><br>- Timeline<br>&nbsp; &nbsp; - Fixed a possible issue when resizing clip<br>&nbsp; &nbsp; - Fixed crash when updating a Scene<br>&nbsp; &nbsp; - Fixed possible issue where edited timeline can no more be started<br>&nbsp; &nbsp; - Fixed disabling auto follow when scrolling manually<br>&nbsp; &nbsp; - Marker follow action \"Pause\" must pause exactly on the marker, so action \"Continue\" restarts playback<br>&nbsp; &nbsp; - Some popup could stay opened on Windows<br>&nbsp; &nbsp; - Fixed possible issue playing a Montage Track with transitions when some visuals are offline<br>&nbsp; &nbsp; - Fixed issue with timeline player clips referencing deleted timeline<br>&nbsp; &nbsp; - Fixed possible app freeze on windows when loading audio file with unicode characters<br>- MadLaser:<br>&nbsp; &nbsp; - Fixed issue with etherdream if started when ILDA frame is more than 4000 points<br>&nbsp; &nbsp; - Fixed laser line texturing with different aspect ratio<br>&nbsp; &nbsp; - Fixed slider with integer value when value is over 1000 (ie slider 16 bits)<br>- Fixed an issue on case sensitive file systems<br>- Fixed control /application/view/fullscreen after changing fullscreen mode manually<br>- AVFoundation movie player: fixed handling audio level in some cases + fixed audio playback after changing system default output<br>- Fixed sending Control feedback (osc, midi) for color (red, green, blue, hue...) when changed from cue / timeline<br>- Fixed loading Online Library (materials etc) when not logged<br>- Fixed starting MadMapper on macOS versions &lt; macOS 13.0 (downgraded NDI library to version 6.1.1 at the moment)<br>- Fixed fullscreen button state when loading project automatically enter fullscreen mode<br>- Fixed possible crash when stopping NDI Output (introduced in 6.0.0 beta 15)</p>\n<h4>MadMapper 6.0 Beta 17 Release Notes</h4>\n<p><span style=\"text-decoration: underline;\">FIXES</span><br>- Timeline<br>&nbsp; &nbsp; - Fixed handling 16 bits fixture sliders<br>&nbsp; &nbsp; - Fixed issue with audio files on Windows<br>&nbsp; &nbsp; - Fixed audio file BPM detection<br>&nbsp; &nbsp; - Fixed possible issue undoing rectangular selection duplication (Alt+drag)<br>&nbsp; &nbsp; - Enable Perspective should be included in Timelines, Cues &amp; Scenes<br>- Fixed possible issue editing fixture with sliders<br>- Fixed laser lines animation with texturing when surface aspect ratio is far from square</p>\n<h4>MadMapper 6.0 Beta 16 Release Notes</h4>\n<p><span style=\"text-decoration: underline;\">IMPROVEMENTS</span><br>* DMX Fixtures:<br>&nbsp; &nbsp; * Prevent unpatching the pixel of a fixture definition with a single pixel (makes no sense)<br>&nbsp; &nbsp; * Make fixtures more visible in preview<br>* Timeline:<br>&nbsp; &nbsp; * Disable play/pause/stop for conductor when External Sync is enabled (Timecode)<br>&nbsp; &nbsp; * Ensure conductor is activated when activating External Sync</p>\n<p>&nbsp;</p>\n<p><span style=\"text-decoration: underline;\">FIXES</span><br>- Timeline:<br>&nbsp; &nbsp; - Montage track with FFMPEG Movie player: fixed possible issue scrubbing in timeline with movie audio enabled<br>&nbsp; &nbsp; - Fixed possible issue exporting timeline<br>&nbsp; &nbsp; - Fixed handling \"Restart\" in montage clips<br>&nbsp; &nbsp; - Fixed a possible issue when cueing geometry<br>- Fixed showing feathering for Lines surfaces</p>\n<h4>MadMapper 6.0 Beta 15 Release Notes</h4>\n<p><span style=\"text-decoration: underline;\">ADDITIONS</span><br>+ Timeline:<br>&nbsp; &nbsp; + Added audio analysis to add snapping points on audio clips key points + detect audio file BPM<br>&nbsp; &nbsp; + Added \"Reveal in Timeline Editor\" on all widgets context menu / objects (next to \"Select Timelines using this setting\"<br>&nbsp; &nbsp; + Added cell navigation controls (to jam in timeline moving left/right/up/down)<br>+ OSC Output / Project Settings: handle Bonjour discovery to auto adjust ip / port and automatically reconnect your external software</p>\n<p>&nbsp;</p>\n<p><span style=\"text-decoration: underline;\">IMPROVEMENTS</span><br>* Timeline:<br>&nbsp; &nbsp; * Don't handle grid exclusivity for timelines started from conductor<br>&nbsp; &nbsp; * Optimizations<br>* MIDI Out &amp; OSC out modules use the devices setup in Project Settings<br>* Optimized engine when working with many outputs<br>* Optimized NDI input &amp; output (improves working with many streams + avoids blocking engine while NDI is encoding)<br>* Updated NDI SDK to 6.2.0</p>\n<p>&nbsp;</p>\n<p><span style=\"text-decoration: underline;\">FIXES</span><br>- Fixed a movie decoding performance issue in FFMPEG player in some conditions<br>- Fixed Control Surface module when multiple units of same device are connected (system might add a number suffix to MIDI device name)<br>- In some cases application could become unresponsive if engine is consuming too much resources<br>- Fixed possible issue with ASIO after fiddling in preferences<br>- Timeline:<br>&nbsp; &nbsp; - fixed re-enable automation when two timelines are playing same attr<br>&nbsp; &nbsp; - Fixed finding back audio files used in timelines in some cases<br>&nbsp; &nbsp; - LTC Sync audio channel : first audio channel should have number 1, not 0<br>&nbsp; &nbsp; - Fixed handling strings in OSC Events track<br>&nbsp; &nbsp; - Fixed annoying cursor jump when editing osc track address<br>&nbsp; &nbsp; - Fixed restoring ExtSync LTC channel number</p>\n<h4>MadMapper 6.0 Beta 14 Release Notes</h4>\n<p><span style=\"text-decoration: underline;\">ADDITIONS</span><br>+ Timeline:<br>&nbsp; &nbsp; + Added an option to generate thumbnails for montage track clips (ie 1 thumbnail per second)<br>&nbsp; &nbsp; + Added OSC Event track to handle multiple addresses on same track</p>\n<p>&nbsp;</p>\n<p><span style=\"text-decoration: underline;\">IMPROVEMENTS</span><br>* Timeline:<br>&nbsp; &nbsp; * Improved user interface for non animated timelines (cues or scenes)<br>&nbsp; &nbsp; * Don't disable all controls when exporting (so oscilators, audio... controls still work)</p>\n<p>&nbsp;</p>\n<p><span style=\"text-decoration: underline;\">FIXES</span><br>- Fixed possible crash after waking up computer or when loading file in some cases<br>- Changing a parameter used in timeline in edit mode was disabling the track, even when paused<br>- A timeline started from conductor must have playback speed controlled by conductor<br>- Fixed export ILDA precision + ILDA FPS in filename if non integer</p>\n<h4>MadMapper 6.0 Beta 13 Release Notes</h4>\n<p><span style=\"text-decoration: underline;\">ADDITIONS</span><br>+ Added a project export function<br>+ Timeline:<br>&nbsp; &nbsp; + Restore Cues &amp; Scenes properly: a timeline is an animated Cue, create a Cue or a Scene and press animate to ad keys in time (avoids unwanted changes in time while working in Cue mode)<br>&nbsp; &nbsp; + Audio, Montage &amp; Timeline Clips can be moved from track to track<br>&nbsp; &nbsp; + Added a button to change play/pause mode in editor (restart playback from time marker, or just continue where playhead is paused)<br>&nbsp; &nbsp; + Shortcut Cmd/Ctrl + Shift + \"+\"/\"-\" to zoom vertically<br>&nbsp; &nbsp; + Added right clip on Montage Clip / Replace Visual...<br>&nbsp; &nbsp; + In Timeline Export, user can set a file name for each output (video &amp; laser)<br>+ MadLaser:<br>&nbsp; &nbsp; + Added Laser Circle surface type<br>&nbsp; &nbsp; + Implemented laser mask feathering (on Laser Quad &amp; Laser Output)<br>&nbsp; &nbsp; + Added distortion transform on Laser Output (fixes projector pincushion distortion)<br>&nbsp; &nbsp; + Added laser Generator \"Laser FX\" to apply a Laser Line FX to a vector source visual<br>+ Added Svg Image player (add image / choose an SVG file) =&gt; you can get a vector input with colors for lasers surfaces and a adjustable size SVG for video surfaces<br>+ Added a way to re-enable discarded audio devices in Preferences</p>\n<p>&nbsp;</p>\n<p><span style=\"text-decoration: underline;\">IMPROVEMENTS</span><br>* Improved MadAI History Management<br>* Improved adding Library resources to Favorites<br>* MadLaser:<br>&nbsp; &nbsp; * Keep showing laser output masks (if enabled) while showing Test Pattern<br>&nbsp; &nbsp; * Optimized masking<br>&nbsp; &nbsp; * Automatically unarm lasers after waking up machine from sleep mode<br>* Timeline<br>&nbsp; &nbsp; * Add timeline clip by double clicking in timeline player track<br>&nbsp; &nbsp; * For data tracks, don&rsquo;t send any value before first key frame<br>* Disable Use Hardware Acceleration option for movie decoding on Windows (can be enabled from project settings), to avoid instability with some graphic drivers, and most of the time performances are not better at the moment<br>* Identify garageCube USB DMX with index on Windows (reloading file was not relinking correctly after a reboot)<br>* AVFoundation Movie Player now redirects audio to the device selected in Project Settings</p>\n<p>&nbsp;</p>\n<p><span style=\"text-decoration: underline;\">FIXES</span><br>- MadLaser:<br>&nbsp; &nbsp; - Fixed reloading project settings depending on laser expert mode<br>- Timeline:<br>&nbsp; &nbsp; - Fixed a bunch of undo/redo issues<br>&nbsp; &nbsp; - Fixed possible issue with movies in montage tracks<br>&nbsp; &nbsp; - Fixed timeline export if audio device list changes while exporting<br>&nbsp; &nbsp; - Handle \"No All\" for audio files that are not found<br>&nbsp; &nbsp; - Fixed issue editing montage clip parameter<br>&nbsp; &nbsp; - Fixed crash inspecting audio track if a clip is offline<br>&nbsp; &nbsp; - Fixed possible first frame issue in video export<br>&nbsp; &nbsp; - Fixed ILDA export precision + first movie frame in some situations<br>&nbsp; &nbsp; - Fixed Montage Clip with materails when editing the material (adding / removing parameters, for instance with MadAI)<br>&nbsp; &nbsp; - Fixed KEY ALL in montage clicks parameter groups</p>\n<h4>MadMapper 6.0 Beta 12 Release Notes</h4>\n<p><span style=\"text-decoration: underline;\">ADDITIONS</span><br>+ MadAI: MadMapper AI to generate visuals (Materials &amp; Laser Materials) or Surface 2D FX</p>\n<h4>MadMapper 6.0 Beta 11 Release Notes</h4>\n<p><span style=\"text-decoration: underline;\">ADDITIONS</span><br>+ Timeline:<br>&nbsp; &nbsp; + Added transitions on Audio Tracks (fade in)<br>&nbsp; &nbsp; + If a timeline stops another one (ie because of horizontal exclusivity): fade out audio tracks from timeline being stopped &amp; keep montage tracks till transition ends<br>&nbsp; &nbsp; + Timeline Automation module handles switching timeline on loop end<br>&nbsp; &nbsp; + Added timeline playback mode \"Controlled Speed\" which adds a speed slider for the playback speed</p>\n<p>&nbsp;</p>\n<p><span style=\"text-decoration: underline;\">IMPROVEMENTS</span><br>* Timeline:<br>&nbsp; &nbsp; * Key frame shape changes depending on interpolation method<br>&nbsp; &nbsp; * Freeze DMX Output when exporting timeline</p>\n<p>&nbsp;</p>\n<p><span style=\"text-decoration: underline;\">FIXES</span><br>- Fixed restoring some project settings after loading file<br>- Fixed crash activating audio routing when audio output is disabled<br>- Fixed generating lines surface geometry in some cases<br>- Fixed converting V5 project cues to timelines for surface color parameters<br>- Fixed a bunch of issues in timelines</p>\n<h4>MadMapper 6.0 Beta 10 Release Notes</h4>\n<p><span style=\"text-decoration: underline;\">ADDITIONS</span><br>+ Reintroduce Scenes: a scene is a timeline that stores everything needed to restore the output state (some options in Project Settings)</p>\n<p>&nbsp;</p>\n<p><span style=\"text-decoration: underline;\">IMPROVEMENTS</span><br>* Render Timeline transition progress on grid cells (like for cues in V5)<br>* Added &ldquo;Match Output Ratio&rdquo; in input preview popup<br>* Double bufferring on Syphon input to improve fluidity<br>* Improved timeline export (export folder management + video encoding CRF =&gt; quality)</p>\n<p>&nbsp;</p>\n<p><span style=\"text-decoration: underline;\">FIXES</span><br>- Made a new Stream Deck Plugin for Timelines<br>- Fixed possible huge memory usafge playing high resolution movies if computer too slow to decode in real-time<br>- Fixed possible vectorization bug on Apple Silicon<br>- Fixed posible uv issue with mesh warping + mask feathering (use intersections with mesh warping segments)<br>- Fixed Generator Chrono<br>- Fixed issue after saving a new project to a separate drive on Windows<br>- Fixes in Video Export + added AV1 Codec on Windows<br>- Some project settings were not resetted on file / new or restored on project load (engine FPS &amp; some others)</p>\n<h4>MadMapper 6.0 Beta 9 Release Notes</h4>\n<p><span style=\"text-decoration: underline;\">ADDITIONS</span><br>+ Added project settings for Timelines<br>+ Added Audio Routing on movies &amp; montage tracks (multi channel input / multi channel output =&gt; routing matrix available)<br>+ Added option to replace a Material / Generator etc. with another on a visual in Media Bin (right click / Replace ...)<br>+ Added Windows Audio Session as audio driver type option in preferences (WASAPI)</p>\n<p>&nbsp;</p>\n<p><span style=\"text-decoration: underline;\">IMPROVEMENTS</span><br>* Optimized DMX Output with many universes<br>* Optimizations in Audio processing<br>* Timeline:<br>&nbsp; &nbsp; Improved edition of Media Clips in Timeline Montage Tracks<br>&nbsp; &nbsp; When adding a key frame and mouse if closed to value curve, adjust<br>&nbsp; &nbsp; Change timeline header display when changing quantization (to bars / frames)<br>&nbsp; &nbsp; * Play does continue playback from where it was when paused<br>&nbsp; &nbsp; * Handle Alt + drag to duplicate selection<br>* When changing artnet network interface in preferences, update unicast table (no need to validate preferences first)<br>* MadLaser:<br>&nbsp; &nbsp; * Update ShowNET library (solves an issue after unplugging / replugging network cable)<br>* Added \"Paste Value\" in widget right click</p>\n<p>&nbsp;</p>\n<p><span style=\"text-decoration: underline;\">FIXES</span><br>- Fixed possible issue in Video Output loopback / spout / ndi on Windows depending Display Scale<br>- Fixed restoring equalizer settings on application startup<br>- Fixed reloading v4 generators<br>- Fixed color interpolation<br>- Show disabled tracks in timeline player clip subtracks<br>- Fixed issues in timeline recording / edit mode (undoing mostly)<br>- Fixed some issues reloading old versions projects<br>- Support standard ISF long declaration (&ldquo;VALUES&rdquo; &amp; &ldquo;LABELS&rdquo;)<br>- Fixed Open DMX USB flickering on Windows<br>- Fixed recording surface color attribute in timelines<br>- Fixed an issue in Laser Quad with mesh warping &amp; input mesh enabled<br>- Fixed audio glitch when timeline marker follow action continue is triggerred<br>- Various fixes in timeline</p>\n<h4>MadMapper 6.0 Beta 8 Release Notes</h4>\n<p><span style=\"text-decoration: underline;\">ADDITIONS</span><br>+ Added an synchronised Favorites collection in Library<br>+ Added a \"Show Surfaces Names\" option in Input View and Output Preview Settings<br>+ Added a \"Switch to media\" button in surface inspector<br>+ Added a way to re-enable discarded video-inputs in Preferences<br>+ Added a custom resource import from another project in Library<br>+ Added Audio Equalizer in Master tab (4 bands, high quality)</p>\n<p>&nbsp;</p>\n<p><span style=\"text-decoration: underline;\">IMPROVEMENTS</span><br>* Timeline:<br>&nbsp; &nbsp; * DMX exports are added to the MadLight sequences<br>&nbsp; &nbsp; * When export mode is enabled, allow timeline player tracks in timelines &amp; ExtSync on timelines<br>&nbsp; &nbsp; * Reduced project file size<br>&nbsp; &nbsp; * Handle timeline looping when putting timelines in a Timeline Player track in conductor<br>* Improved Save and autosave Timing<br>* Simplified Autosave enabling / disabling<br>* Enable rotative selection in preview through different types (video / laser / dmx)<br>* Handle audio device disconnection<br>* Adapted sample projects for timeline</p>\n<p>&nbsp;</p>\n<p><span style=\"text-decoration: underline;\">FIXES</span><br>- Fixed saving projects resources on Windows<br>- Fixed loading older projects<br>- Fixed relinking files by relative path when loading a windows project on macOS<br>- Fixed converting MM 5 project file when loading cues for modules parameters in timelines<br>- Fixed an issue in timeline MIDI &amp; OSC tracks playback<br>- Fixed editing timeline keyframe time from spinbox<br>- Update audio clip duration after reloading file<br>- Fixed possible crash with soft-edge on laser quad<br>- Fixed possible issue in DMX Router module<br>- Fixed finding external media when loading a Windows project on Mac<br>- Fixed disabled media-preview after loading a project<br>- Fixed import fixtures from csv / svg (coordinates in pixels in output)</p>\n<h4>MadMapper 6.0 Beta 7 Release Notes</h4>\n<p><span style=\"text-decoration: underline;\">ADDITIONS</span><br>+ Added play buttons in timeline grid headers(to start whole column or row)<br>+ Added timeline grid next / preview (column/row) buttons<br>+ Added pause button for timelines (play / pause / stop)<br>+ Added \"Reveal in Timeline Editor\" on Montage visuals in media bin</p>\n<p>&nbsp;</p>\n<p><span style=\"text-decoration: underline;\">IMPROVEMENTS</span><br>* Timeline:<br>&nbsp; &nbsp; * Handle pasting timeline key frame selection from multiple tracks to other tracks (if compatible types)<br>&nbsp; &nbsp; * External Sync: handle offset parameter in timecode<br>&nbsp; &nbsp; * When starting timeline cell, handle exclusivity only on cells with a timeline<br>&nbsp; &nbsp; * Track order in respects view order (surface/media order, parameters order in inspectors)<br>* MadLaser: rewriting of etherdream makes it much more stable and avoid any situation where it would keep not more work without restart<br>* Save a Copy... now loads the copy afterwards<br>* Project Settings are now integrated into the Preferences dialog<br>* Switch to conductor edition when dragging a timeline from grid over conductor preview<br>* Improved sorting by IP in ArtNet unicast table<br>* Always export artnet unicast table in CSV format<br>* MadLaser: when exporting ilda, add the FPS in filename &amp; look for it when importing ilda movie<br>* MadLaser: update etherdream IP &amp; device name if changed<br>* Updated Ponk Output to handle multicast + handle multicast in Ponk Input<br>* Update to NDI SDK 6.1.1 (solves possible NDI input issue on macOS Sequoia)</p>\n<p>&nbsp;</p>\n<p><span style=\"text-decoration: underline;\">FIXES</span><br>- Fixed a memory leak when animating geometry<br>- Fixed possible issue with Fixture Line display<br>- Fixed possible audio glitch when starting audio output<br>- When selecting a node, edit only tracks not filtered (by search text or other filters)<br>- Fixed reloading ArtNet unicast table from project settings (introduced in beta 6)<br>- Fixed reconnecting USB DMX output device when loading project (introduced in beta 6)<br>- Fixed timeline edit on QColorWidget with wheel or palette<br>- Fixed cueing color when changing sub control (ie &ldquo;red&rdquo;) in montage clips<br>- When looping with marker, preserve precise timing (like when looping with loop)<br>- MadLaser: Fixed possible issue working with multiple Helios DACs (after disconnecting / reconnecting one)<br>- MadLaser: Time Shift =&gt; Color Delay + increased value range + inverted effect + rgb shift =&gt; color shift (affects all channels including u1,u2&hellip;)<br>- PJ Link: fixed module in MadMapper 6<br>- Fixed recording ISF event inputs in timeline<br>- Fixed showing Color Profile in movie parameters<br>- Fixed a possible issue with AbletonLink<br>- Fixed \"Fullscreen when opening the project at Startup\" in some conditions<br>- Fixed adding surface group settings in timelines<br>- Fixed pasting color value (in webcolor format #FF00EB) in color widget<br>- Ensure last started timeline takes control over parameters<br>- Update timeline audio players after changing audio output in preferences<br>- Various fixes in timelines</p>\n<h4>MadMapper 6.0 Beta 6 Release Notes</h4>\n<p><span style=\"text-decoration: underline;\">ADDITIONS</span><br>+ Handle starting timeline cell row / column (depending on exclusivity) via column/row buttons or via Controls<br>+ Moved numerous settings from preferences to project-settings<br>+ New Timeline Scheduler module, as powerful but easier to understand, and with option to stop playback when reaching loop end</p>\n<p>&nbsp;</p>\n<p><span style=\"text-decoration: underline;\">IMPROVEMENTS</span><br>* Calendar Scheduler handles starting &amp; stopping timelines using calendar event start &amp; end time<br>* Improved Startup Timeline module<br>* Handle pinned state for all track types (Audio &amp; Montage<br>* Added &ldquo;Select timelines using this object&rdquo; on modules<br>* \"Select timelines using this parameter\" now automatically select tracks for the attribute (then delete key can delete all tracks for this parameter in all timelines)<br>* Don't add tracks for layers Output Geometry, Lines, Mask, Soft-Edge by default (can be added to timelines manually in Edit Mode)<br>* Stop conductor &amp; timelines when switching bank<br>* Possibility to hide the input and output-preview panels<br>* Controls to timeline cells now offer \"play\", \"play_from_beginning\", \"pause\", \"stop\", \"loop_enabled\", \"position\", \"fade_time\", \"go_to_previous_marker\" &amp; \"go_to_next_marker\"</p>\n<p>&nbsp;</p>\n<p><span style=\"text-decoration: underline;\">FIXES</span><br>- Fixed setting input geometry from surface inspector<br>- Fixed possible crash after undoing recording in a track<br>- Fixed renaming markers from Conductor Controls<br>- Fixed updating fixture params &amp; dmx address in list when editing fixture definition<br>- Fixed issue changing timeline track transition settings on a multiselection of timelines<br>- Fixed media track playback after moving timeline from a cell to another<br>- Fixed some parameter changes in timeline media clips<br>- Fixed some issues when recording tracks &amp; undo/redo<br>- Fixed crash when deleting time range selection in Montage clip subtracks<br>- Fixed possible issue in timeline export if one video output has unsupported resolution<br>- Fixed issues in color track rendering (in sub timelines)<br>- Fixed crash on exit if multiple external panels extracted<br>- Handle &ldquo;Select timelines using this object&rdquo; on Montages in Media Bin<br>- Fixed playing trigger key frame (ie visual \"Restart\") exactly on loop start<br>- Fixed possible issue in materials time bases / speed parameter<br>- Fixed possible issue with ILDA animations in Montage track<br>- Fixed possible issue after dropping a track to a timeline cell with same track id<br>- Don&rsquo;t delete hidden tracks when deleting node (ie search text \"opacity\", select node \"/Surfaces/Quad 1\", delete =&gt; just delete visible tracks, not all track for Quad 1)<br>- Fixed timeline tracks playback after renaming module<br>- Fixed \"Update from Current Value\" on track when multiple timelines are selected</p>\n<h4>MadMapper 6.0 Beta 5 Release Notes</h4>\n<p><span style=\"text-decoration: underline;\">ADDITIONS</span><br>+ Added Conductor Scheduler module</p>\n<p>&nbsp;</p>\n<p><span style=\"text-decoration: underline;\">IMPROVEMENTS</span><br>* MadLaser: Optimized Ilda movie<br>* Various optimizations</p>\n<p>&nbsp;</p>\n<p><span style=\"text-decoration: underline;\">FIXES</span><br>- Fixed possible crash handling fx timebase<br>- Fixed loopback rendering on Windows with display scale 150% (was zoomed in beta 3)<br>- Fixed statrup issue in original main display configurations<br>- Lines Surfaces Active Segment was added twice in timelines<br>- Fixed Controls in Layer Group content settings<br>- Fixed Fullscreen Video Cursor position in some circumstances<br>- Some parameters where not handled in \"Edit Timelines\" mode (timeline record button)<br>- Fixed animating Lines surfaces / Active Segment with timelines<br>- Fixed loopback/spout/ndi render on windows with display scale 150% 175% etc (was zoomed in)<br>- Optimized &amp; fixed possible crash simplifying long selection of items<br>- Fixed smooth playback of some high resolution movies files</p>\n<h4>MadMapper 6.0 Beta 4 Release Notes</h4>\n<p><span style=\"text-decoration: underline;\">ADDITIONS</span><br>+ Allow renaming MIDI &amp; OSC tracks<br>+ When a timeline takes control over a parameter, show its name in any other timeline disabled track<br>+ Added \"Delete Time\" option when right clicking time header (top horizontal header in timeline editor)<br>+ Preserve conductor / timelines export settings<br>+ Export Timeline suports m4a for audio output (mp3 is limited to mono or stereo)<br>+ Video Cursor can be styled (Cross or Circle)<br>+ Added keyboard shortcuts for object-tabs (media, video surfaces, laser surfaces, etc)</p>\n<p>&nbsp;</p>\n<p><span style=\"text-decoration: underline;\">IMPROVEMENTS</span><br>* Auto scroll when moving playhead on view extremities<br>* Shift+Click in time header to select a range of time<br>* More precise message on disabled timeline track (ie \"Parameter has been modified by MIDI Control\")<br>* Show error message when timeline export fails<br>* Execute timeline track when editing keyframes in paused mode, even when Timeline Edit mode is active</p>\n<p>&nbsp;</p>\n<p><span style=\"text-decoration: underline;\">FIXES</span><br>- Bezier keyframe before a keyframe of another type was ignoring next keyframe bezier handle<br>- Fixed smoothness when animating Line Surfaces active segment settings<br>- Fixed possible issue showing timeline cell setting popup<br>- Fixed possible issue changing global bpm settings<br>- Fixed DMX output issue when using a DMX Output and rescaling it<br>- Duplicating a selection of handle was removing last source selection item in some cases<br>- Middle mouse on time horizontal header was not handling \"scroll and drag\"<br>- Fixed collapsing / expanding nodes in subtimelines edited from conductor<br>- Fixed changing parameters of a multiselection of montage clips<br>- Fixed video export after changing timeline FPS<br>- Fixed audio distortion issue on windows when playing multiple tracks (from timeline, module, movies)<br>- Fixed possible issue after deleting montage clip and removing clip media from bin<br>- Fixed Video Output exports blocked after 12 minutes<br>- Fixed export resolution on Windows<br>- Fixed renaming fixture while some sliders are animated<br>- Fixed audio when exporting conductor with timeline player tracks<br>- Fixed issue if an error occurs reading ISF header in an ISF visual shader file + handle \"CUBE_MAP\" in image types<br>- When using a loopback in a Montage Track, it wasn't updated when timeline was not playing<br>- Fixed startup issue on macOS 11 / Mac Intel<br>- Fixed undoing fixture slider value change<br>- Fixed potential issue when drag&amp;dropping from Library<br>- Fixed issue reordering conductor sub-timeline tracks</p>\n<h4>MadMapper 6.0 Beta 3 Release Notes</h4>\n<p><span style=\"text-decoration: underline;\">IMPROVEMENTS</span><br>* Added Hap Chunk count in export settings<br>* Added color header in conductor edited sub timeline tracks</p>\n<p>&nbsp;</p>\n<p><span style=\"text-decoration: underline;\">FIXES</span><br>- Fixed possible issue with FX Timebase track<br>- Fixed possible crash with shift-click in media<br>- Fixed select / all with same value in clip subtrack<br>- Fixed &ldquo;update from current values&rdquo; in timeline inspector<br>- Image Folder Player: fixed crash if no image in folder<br>- Fixed possible crash reordering timeline player tracks<br>- Fixed issue when deleting timeline bank and undoing (not restoring timelines)<br>- Fixed audio mono file in audio track playback with stereo output<br>- Fixed surface visual transition on edited timeline when started with control<br>- MM Laser: fixed laser text default stroke font<br>- Fixed possible issue transitionning geometry / lines / masks tracks<br>- Fixed edit mode &amp; DMX Fixture geometry<br>- Fixed MIDI out track disabling itself if MIDI channel is assigned internally</p>\n<h4>MadMapper 6.0 Beta 2 Release Notes</h4>\n<p><span style=\"text-decoration: underline;\">FIXES</span><br>- Don't handle track transition when not playing (moving playhead)<br>- On Windows, prevent multiple instances of same MadMapper executable</p>\n<h4>MadMapper 6.0 Beta 1 Release Notes</h4>\n<p><span style=\"text-decoration: underline;\">ADDITIONS</span></p>\n<p>+ Added Timelines:<br>&nbsp; &nbsp; + Timelines are replacing Cues, they are like Cues but all parameters can be animated<br>&nbsp; &nbsp; + Visuals can be added in Montage Tracks and used as visual for video / laser layers<br>&nbsp; &nbsp; + Audio Track<br>&nbsp; &nbsp; + OSC / MIDI Output tracks<br>&nbsp; &nbsp; + Markers allow interactivity on timeline playback<br>&nbsp; &nbsp; + Conductor is the master timeline, it can be synced to an external Time Code (MIDI MTC / Audio LTC / ArtNet TimeCode)<br>&nbsp; &nbsp; + Montage tracks control media playback (Movies, Materials, Generators etc.)<br>&nbsp; &nbsp; + Surface FX Timebase can be controlled by timelines playyback<br>&nbsp; &nbsp; + Export your timeline to get movies for each Video Output, ILDA file for each Laser Output, Audio File for all audio in timeline (audio tracks &amp; montage tracks), MadLight Sequence for DMX Output<br>&nbsp; &nbsp; + Timeline in grid (not conductor) can be synched to BPM with Quantized Launch &amp; BPM Sync Playback. Sync your Video, your LEDs, Lights &amp; Lasers with Ableton Link<br>+ MadMapper Projects are now stored in a folder with resources (workspace)<br>&nbsp; &nbsp; + Menu File / Collect and Save allows you to import all necessary resources (Materials, movies, audio files etc.) so your project can be easiely moved to another computer<br>+ MadLight: DMX Fixtures are now in the output and sampling video surfaces<br>+ Support more display scale ratio on Windows (like scaling 150%, before MadMapper supported 100% or 200% but not inbetween)<br>+ MIDI / OSC outputs can be defined in Project Settings<br>+ Object Tracks can be pinned (pinned tracks always keep visible when searching text) + filter to show only pinned tracks<br>+ Support render passes in ISFs<br>+ Library resources (Materials etc.) are available offline (when no internet)</p>\n<p>&nbsp;</p>\n<p><span style=\"text-decoration: underline;\">IMPROVEMENTS</span></p>\n<p>* Media Tab is on left side by default, can be extracted on the right side with menu View / Extract Media Tab or with toolbar button<br>* Fading colors is made in perceptive space (in timeline track/key transitions)</p>"
  },
  {
    "pageSuid": "SHnUKVrkbF",
    "pageSlug": "madmapper-legacy",
    "lang": "en",
    "content": ""
  },
  {
    "pageSuid": "fGXMx4IhnL",
    "pageSlug": "meet-madmapper",
    "lang": "en",
    "content": ""
  },
  {
    "pageSuid": "hY3zyDQlLz",
    "pageSlug": "evolution-of-madmapper",
    "lang": "en",
    "content": ""
  },
  {
    "pageSuid": "VItu9oKKNm",
    "pageSlug": "getting-started",
    "lang": "en",
    "content": ""
  },
  {
    "pageSuid": "0yIEG8azhm",
    "pageSlug": "hardware-and-system-essentials",
    "lang": "en",
    "content": "<p>MaMapper's Hardware and System Essentials</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>"
  },
  {
    "pageSuid": "Tj08gThYjn",
    "pageSlug": "licensing",
    "lang": "en",
    "content": ""
  },
  {
    "pageSuid": "kwciF95sFo",
    "pageSlug": "madmapper-account",
    "lang": "en",
    "content": ""
  },
  {
    "pageSuid": "66c3K4wgWL",
    "pageSlug": "software-installation",
    "lang": "en",
    "content": ""
  },
  {
    "pageSuid": "VgqPuF3O8p",
    "pageSlug": "authorizing-madmapper",
    "lang": "en",
    "content": ""
  },
  {
    "pageSuid": "WLPRb6ReP9",
    "pageSlug": "seats-usage-good-practice",
    "lang": "en",
    "content": ""
  },
  {
    "pageSuid": "rRg6DLZxfz",
    "pageSlug": "first-launch-and-new-project",
    "lang": "en",
    "content": ""
  },
  {
    "pageSuid": "nBi9Vk0pWM",
    "pageSlug": "workspaces",
    "lang": "en",
    "content": ""
  },
  {
    "pageSuid": "cYhyTFKBg3",
    "pageSlug": "troubleshooting",
    "lang": "en",
    "content": ""
  },
  {
    "pageSuid": "XRAg1d7EWb",
    "pageSlug": "learn-the-fundamentals",
    "lang": "en",
    "content": ""
  },
  {
    "pageSuid": "Biuw0Z767c",
    "pageSlug": "interface-overview",
    "lang": "en",
    "content": ""
  },
  {
    "pageSuid": "5QNKvdWAvv",
    "pageSlug": "media-pool",
    "lang": "en",
    "content": ""
  },
  {
    "pageSuid": "7Wad2UTltR",
    "pageSlug": "sufaces",
    "lang": "en",
    "content": ""
  },
  {
    "pageSuid": "cyHfGqwmSP",
    "pageSlug": "fixtures",
    "lang": "en",
    "content": ""
  },
  {
    "pageSuid": "NXy9BMBaQi",
    "pageSlug": "projectors-setup",
    "lang": "en",
    "content": ""
  },
  {
    "pageSuid": "Zu9lM5wmy5",
    "pageSlug": "modules",
    "lang": "en",
    "content": ""
  },
  {
    "pageSuid": "WhevrbYA4M",
    "pageSlug": "master-tab",
    "lang": "en",
    "content": ""
  },
  {
    "pageSuid": "arFDfOAHk1",
    "pageSlug": "advanced-tools",
    "lang": "en",
    "content": ""
  },
  {
    "pageSuid": "lGAwFxCVEO",
    "pageSlug": "menus-and-preferences",
    "lang": "en",
    "content": ""
  },
  {
    "pageSuid": "adDlVVcHKA",
    "pageSlug": "faq",
    "lang": "en",
    "content": ""
  }
]